## Recuperando dados do PMAQ

Neste notebook são usados os dados disponibilizados para
recuperar e agrupar as respostas do PMAQ.

In [38]:
import pandas as pd
import numpy as np

import datetime

O primeiro passo é importar os CSVs. Escolher apenas as variáveis referentes a sífilis e teste rápido ajuda a diminuir o tempo de processamento e espaço ocupado.

In [4]:
m1 = pd.read_csv('../data/BANCO_PMAQ/M_I.csv', usecols=['IBGE', 'CNES_FINAL', 'DATA', 'I.11.1', 'I.15.9.3', 'I.15.9.4'], sep=';', parse_dates=['DATA'])

m1.head()

/Users/mayradazvd/workspace/alaunus/lib/python3.7/site-packages/IPython/core/interactiveshell.py:3051: DtypeWarning: Columns (8) have mixed types. Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

,IBGE,CNES_FINAL,DATA,I.11.1,I.15.9.3,I.15.9.4
0,120001,3382745,2017-10-16 11:55:06.999000+00:00,1,2,2
1,120001,3393984,2017-10-16 11:53:35.875000+00:00,1,998,998
2,120001,3638685,2017-10-16 11:56:20.573000+00:00,1,2,2
3,120001,5403669,2017-10-16 11:58:08.037000+00:00,1,2,2
4,120005,3797554,2017-10-16 01:35:10.520000+00:00,1,998,998

In [5]:
m1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30346 entries, 0 to 30345
Data columns (total 6 columns):
IBGE          30346 non-null int64
CNES_FINAL    30346 non-null object
DATA          30346 non-null datetime64[ns, UTC]
I.11.1        30346 non-null int64
I.15.9.3      30346 non-null int64
I.15.9.4      30346 non-null int64
dtypes: datetime64[ns, UTC](1), int64(4), object(1)
memory usage: 1.4+ MB

In [6]:
m2 = pd.read_csv('../data/BANCO_PMAQ/M_II.csv', usecols=['IBGE', 'CNES_FINAL', 'INE', 'DATA', 'II.12.1.7', 'II.15.13'], sep=';', parse_dates=['DATA'])

m2.head()

,IBGE,INE,CNES_FINAL,DATA,II.12.1.7,II.15.13
0,120001,4294,3006166,2018-10-15 21:40:41.803000+00:00,9997,9997
1,120001,4316,3382745,2017-10-16 11:54:56.667000+00:00,1,1
2,120001,4324,3393984,2017-10-16 11:52:59.062000+00:00,1,1
3,120001,4332,3638685,2017-10-16 11:56:10.811000+00:00,1,1
4,120001,4340,5403669,2017-10-16 11:57:57.439000+00:00,1,2

In [7]:
m2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 38865 entries, 0 to 38864
Data columns (total 6 columns):
IBGE          38865 non-null int64
INE           38865 non-null int64
CNES_FINAL    38865 non-null object
DATA          38865 non-null datetime64[ns, UTC]
II.12.1.7     38865 non-null int64
II.15.13      38865 non-null int64
dtypes: datetime64[ns, UTC](1), int64(4), object(1)
memory usage: 1.8+ MB

In [8]:
m3 = pd.read_csv('../data/BANCO_PMAQ/M_III.csv', usecols=['IBGE', 'CNES_FINAL', 'INE', 'DATA', 'III.13.7.3'], sep=';', parse_dates=['DATA'])

m3.head()

     IBGE   INE CNES_FINAL                             DATA  III.13.7.3
0  120001  4294    3006166 2017-10-16 11:50:54.137000+00:00        9997
1  120001  4294    3006166 2017-10-16 11:51:12.654000+00:00        9997
2  120001  4294    3006166 2017-10-16 11:51:22.096000+00:00        9997
3  120001  4294    3006166 2017-10-16 11:50:42.849000+00:00        9997
4  120001  4316    3382745 2017-10-16 11:54:14.817000+00:00         998

In [9]:
m3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 157497 entries, 0 to 157496
Data columns (total 5 columns):
IBGE          157497 non-null int64
INE           157497 non-null int64
CNES_FINAL    157497 non-null object
DATA          157497 non-null datetime64[ns, UTC]
III.13.7.3    157497 non-null int64
dtypes: datetime64[ns, UTC](1), int64(3), object(1)
memory usage: 6.0+ MB

Com os módulos carregados, vamos filtrar apenas as respostas de Natal

In [10]:
m1_natal = m1.query('IBGE == 240810')

m1_natal.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 42 entries, 22251 to 22292
Data columns (total 6 columns):
IBGE          42 non-null int64
CNES_FINAL    42 non-null object
DATA          42 non-null datetime64[ns, UTC]
I.11.1        42 non-null int64
I.15.9.3      42 non-null int64
I.15.9.4      42 non-null int64
dtypes: datetime64[ns, UTC](1), int64(4), object(1)
memory usage: 2.3+ KB

In [11]:
m2_natal = m2.query('IBGE == 240810')

m2_natal.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 121 entries, 28650 to 28770
Data columns (total 6 columns):
IBGE          121 non-null int64
INE           121 non-null int64
CNES_FINAL    121 non-null object
DATA          121 non-null datetime64[ns, UTC]
II.12.1.7     121 non-null int64
II.15.13      121 non-null int64
dtypes: datetime64[ns, UTC](1), int64(4), object(1)
memory usage: 6.6+ KB

In [12]:
m3_natal = m3.query('IBGE == 240810')

m3_natal.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 495 entries, 115946 to 116440
Data columns (total 5 columns):
IBGE          495 non-null int64
INE           495 non-null int64
CNES_FINAL    495 non-null object
DATA          495 non-null datetime64[ns, UTC]
III.13.7.3    495 non-null int64
dtypes: datetime64[ns, UTC](1), int64(3), object(1)
memory usage: 23.2+ KB

# Agrupamento

Tratar os dados do terceiro ciclo (2016-08-01 a 2018-01-22)

In [13]:
m1.DATA.dt.year.unique()

array([2017, 2018, 2019, 2000, 1970, 2012])

In [14]:
# checando datas estranhas
m1[ m1.DATA.dt.year == 1970]

,IBGE,CNES_FINAL,DATA,I.11.1,I.15.9.3,I.15.9.4
5570,230990,2478528,1970-02-24 09:41:43.930000+00:00,1,998,998
16157,251740,2363402,1970-01-02 04:34:04.648000+00:00,1,1,2
29233,530010,5038669,1970-01-16 17:34:01.029000+00:00,9997,9997,9997

In [18]:
# filtra datas
m1['DATA'] = m1.DATA.dt.tz_localize(None)
m2['DATA'] = m2.DATA.dt.tz_localize(None)
m3['DATA'] = m3.DATA.dt.tz_localize(None)
m1_df = m1.query("'2016-08-01' < DATA < '2018-01-22'")
m2_df = m2.query("'2016-08-01' < DATA < '2018-01-22'")
m3_df = m3.query("'2016-08-01' < DATA < '2018-01-22'")

Para agrupar os dados, agora criamos uma coluna para guardar o ano da resposta

In [20]:
m1_df.loc[:,'ANO'] = m1_df.DATA.dt.year
m2_df.loc[:,'ANO'] = m2_df.DATA.dt.year
m3_df.loc[:,'ANO'] = m3_df.DATA.dt.year

/Users/mayradazvd/workspace/alaunus/lib/python3.7/site-packages/pandas/core/indexing.py:494: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self.obj[item] = s

In [21]:
# Verificando anos disponiveis
print(m1_df.ANO.unique())
print(m2_df.ANO.unique())
print(m3_df.ANO.unique())

[2017 2018]
[2017 2018]
[2017 2018]

In [73]:
# Agrupando
df1 = pd.pivot_table(m1_df, index=['I.11.1'], columns=[ 'ANO'], values=['CNES_FINAL'],
               aggfunc='count', fill_value=0)

df1

       CNES_FINAL
ANO          2017 2018
I.11.1
1           15082    7
2            7139    0
9997          925    0

In [97]:
cols = [['I.11.1', 'I.11.1', 'I.11.1'],
       ['1', '2', '9997']]
tuples = list(zip(*cols))
print(tuples)
index = pd.MultiIndex.from_tuples(tuples, names=['VAR', 'CODE'])
df_final = pd.DataFrame(df1.values, index=index, columns=['2017', '2018'])
df_final

[('I.11.1', '1'), ('I.11.1', '2'), ('I.11.1', '9997')]

              2017  2018
VAR    CODE
I.11.1 1     15082     7
       2      7139     0
       9997    925     0

In [98]:
df2 = pd.pivot_table(m1_df, index=['I.15.9.3'], columns=[ 'ANO'], values=['CNES_FINAL'],
               aggfunc='count', fill_value=0)
df2

         CNES_FINAL
ANO            2017 2018
I.15.9.3
1              9889    2
2              6504    1
998            5828    4
9997            925    0

In [99]:
cols = [['I.15.9.3', 'I.15.9.3', 'I.15.9.3', 'I.15.9.3'],
       ['1', '2', '998', '9997']]
tuples = list(zip(*cols))
print(tuples)
index = pd.MultiIndex.from_tuples(tuples, names=['VAR', 'CODE'])
df_final = df_final.append(pd.DataFrame(df2.values, index=index, columns=['2017', '2018']))
df_final

[('I.15.9.3', '1'), ('I.15.9.3', '2'), ('I.15.9.3', '998'), ('I.15.9.3', '9997')]

                2017  2018
VAR      CODE
I.11.1   1     15082     7
         2      7139     0
         9997    925     0
I.15.9.3 1      9889     2
         2      6504     1
         998    5828     4
         9997    925     0

In [100]:
df3 = pd.pivot_table(m1_df, index=['I.15.9.4'], columns=['ANO'], values=['CNES_FINAL'],
               aggfunc='count', fill_value=0)
df3

         CNES_FINAL
ANO            2017 2018
I.15.9.4
1              2911    2
2             13482    1
998            5828    4
9997            925    0

In [101]:
cols = [['I.15.9.4', 'I.15.9.4', 'I.15.9.4', 'I.15.9.4'],
       ['1', '2', '998', '9997']]
tuples = list(zip(*cols))
print(tuples)
index = pd.MultiIndex.from_tuples(tuples, names=['VAR', 'CODE'])
df_final = df_final.append(pd.DataFrame(df3.values, index=index, columns=['2017', '2018']))
df_final

[('I.15.9.4', '1'), ('I.15.9.4', '2'), ('I.15.9.4', '998'), ('I.15.9.4', '9997')]

                2017  2018
VAR      CODE
I.11.1   1     15082     7
         2      7139     0
         9997    925     0
I.15.9.3 1      9889     2
         2      6504     1
         998    5828     4
         9997    925     0
I.15.9.4 1      2911     2
         2     13482     1
         998    5828     4
         9997    925     0

In [102]:
# m2: II.12.1.7, II.15.13
df4 = pd.pivot_table(m2_df, index=['II.12.1.7'], columns=['ANO'], values=['CNES_FINAL'],
               aggfunc='count', fill_value=0)
df4

          CNES_FINAL
ANO             2017 2018
II.12.1.7
1              27316    7
2                377    1
9997            1239    0

In [104]:
cols = [['II.12.1.7', 'II.12.1.7', 'II.12.1.7'],
       ['1', '2', '9997']]
tuples = list(zip(*cols))
print(tuples)
index = pd.MultiIndex.from_tuples(tuples, names=['VAR', 'CODE'])
df_final = df_final.append(pd.DataFrame(df4.values, index=index, columns=['2017', '2018']))
df_final

[('II.12.1.7', '1'), ('II.12.1.7', '2'), ('II.12.1.7', '9997')]

                 2017  2018
VAR       CODE
I.11.1    1     15082     7
          2      7139     0
          9997    925     0
I.15.9.3  1      9889     2
          2      6504     1
          998    5828     4
          9997    925     0
I.15.9.4  1      2911     2
          2     13482     1
          998    5828     4
          9997    925     0
II.12.1.7 1     27316     7
          2       377     1
          9997   1239     0

In [106]:
df5 = pd.pivot_table(m2_df, index=['II.15.13'], columns=['ANO'], values=['CNES_FINAL'],
               aggfunc='count', fill_value=0)
df5

         CNES_FINAL
ANO            2017 2018
II.15.13
1             20691    7
2              7002    1
9997           1239    0

In [107]:
cols = [['II.15.13', 'II.15.13', 'II.15.13'],
       ['1', '2', '9997']]
tuples = list(zip(*cols))
print(tuples)
index = pd.MultiIndex.from_tuples(tuples, names=['VAR', 'CODE'])
df_final = df_final.append(pd.DataFrame(df5.values, index=index, columns=['2017', '2018']))
df_final

[('II.15.13', '1'), ('II.15.13', '2'), ('II.15.13', '9997')]

                 2017  2018
VAR       CODE
I.11.1    1     15082     7
          2      7139     0
          9997    925     0
I.15.9.3  1      9889     2
          2      6504     1
          998    5828     4
          9997    925     0
I.15.9.4  1      2911     2
          2     13482     1
          998    5828     4
          9997    925     0
II.12.1.7 1     27316     7
          2       377     1
          9997   1239     0
II.15.13  1     20691     7
          2      7002     1
          9997   1239     0

In [110]:
#m3: III.13.7.3
df6 = pd.pivot_table(m3_df, index=['III.13.7.3'], columns=['ANO'], values=['CNES_FINAL'],
               aggfunc='count', fill_value=0)
df6

           CNES_FINAL
ANO              2017 2018
III.13.7.3
1               13666    6
2                 721    0
998             89802   38
9997            14016    1

In [111]:
cols = [['III.13.7.3', 'III.13.7.3', 'III.13.7.3', 'III.13.7.3'],
       ['1', '2', '998', '9997']]
tuples = list(zip(*cols))
print(tuples)
index = pd.MultiIndex.from_tuples(tuples, names=['VAR', 'CODE'])
df_final = df_final.append(pd.DataFrame(df6.values, index=index, columns=['2017', '2018']))
df_final

[('III.13.7.3', '1'), ('III.13.7.3', '2'), ('III.13.7.3', '998'), ('III.13.7.3', '9997')]

                  2017  2018
VAR        CODE
I.11.1     1     15082     7
           2      7139     0
           9997    925     0
I.15.9.3   1      9889     2
           2      6504     1
           998    5828     4
           9997    925     0
I.15.9.4   1      2911     2
           2     13482     1
           998    5828     4
           9997    925     0
II.12.1.7  1     27316     7
           2       377     1
           9997   1239     0
II.15.13   1     20691     7
           2      7002     1
           9997   1239     0
III.13.7.3 1     13666     6
           2       721     0
           998   89802    38
           9997  14016     1

In [112]:
df_final.to_csv('../data/pmaq.csv') # salvando CSV